# Get json from json-server

In [13]:
import requests

In [14]:
response = requests.get("http://localhost:3000/response").text

In [15]:
response[0:2500]

'{\n  "users": [\n    {\n      "id": 1,\n      "created": "2022-07-16",\n      "tckn": "5178249801",\n      "username": "2349600692",\n      "clarification_text": true,\n      "user_agreement": true,\n      "consent_text": false,\n      "field": []\n    },\n    {\n      "id": 2,\n      "created": "2022-06-25",\n      "tckn": "9862687290",\n      "username": "2655382030",\n      "clarification_text": true,\n      "user_agreement": true,\n      "consent_text": true,\n      "field": [\n        {\n          "id": 1,\n          "farm_name": "Paget",\n          "lat": 47.93520072,\n          "lng": 13.710337028,\n          "area": 95.535737494,\n          "plant": "Waterhyssop",\n          "season_start_date": "2022-04-04 09:15:37",\n          "season_end_date": "2022-05-15 20:20:36"\n        }\n      ]\n    },\n    {\n      "id": 3,\n      "created": "2022-06-05",\n      "tckn": "5730841345",\n      "username": "4979548189",\n      "clarification_text": false,\n      "user_agreement": false,\n      "consent_text": true,\n      "field": [\n        {\n          "id": 1,\n          "farm_name": "Parkside",\n          "lat": 45.287717074,\n          "lng": 58.064253139,\n          "area": 24.12880332,\n          "plant": "Starhorn",\n          "season_start_date": "2022-05-08 17:24:33",\n          "season_end_date": "2022-07-29 05:36:34"\n        }\n      ]\n    },\n    {\n      "id": 4,\n      "created": "2022-05-22",\n      "tckn": "6701194524",\n      "username": "2213833846",\n      "clarification_text": false,\n      "user_agreement": true,\n      "consent_text": false,\n      "field": []\n    },\n    {\n      "id": 5,\n      "created": "2022-05-18",\n      "tckn": "0139000380",\n      "username": "4164911712",\n      "clarification_text": false,\n      "user_agreement": true,\n      "consent_text": true,\n      "field": []\n    },\n    {\n      "id": 6,\n      "created": "2022-07-18",\n      "tckn": "3837556891",\n      "username": "3179584399",\n      "clarification_text": true,\n      "user_agreement": true,\n      "consent_text": false,\n      "field": [\n        {\n          "id": 1,\n          "farm_name": "3rd",\n          "lat": 48.529810885,\n          "lng": 38.493641502,\n          "area": 82.89315977,\n          "plant": "Salinas River Tarweed",\n          "season_start_date": "2022-06-19 01:04:36",\n          "season_end_date": "2022-07-16 06:14:16"\n        }\n      ]\n    },\n    {\n      "id": 7,\n      "created": "2022-04-24",\n      "tckn": "1183755635",\n      "username": "2423866368",\n      "clarification_text": false,\n      "user_agreeme'

In [16]:
import json

In [17]:
response_info = json.loads(response)

In [18]:
type(response_info)

dict

In [19]:
response_info["users"][2]

{'id': 3,
 'created': '2022-06-05',
 'tckn': '5730841345',
 'username': '4979548189',
 'clarification_text': False,
 'user_agreement': False,
 'consent_text': True,
 'field': [{'id': 1,
   'farm_name': 'Parkside',
   'lat': 45.287717074,
   'lng': 58.064253139,
   'area': 24.12880332,
   'plant': 'Starhorn',
   'season_start_date': '2022-05-08 17:24:33',
   'season_end_date': '2022-07-29 05:36:34'}]}

In [20]:
response_info["credits"][2]

{'id': 3,
 'created': '2022-06-18',
 'created_amount': 130501,
 'demand_gsm': '2074029926',
 'city': 'Ono',
 'town': '9348 Lunder Trail',
 'username': '3888799340',
 'tckn': '0449677117'}

# Transform json data to pandas dataframes.

In [21]:
import pandas as pd

In [22]:
users = pd.DataFrame(response_info["users"])
users.head()

,id,created,tckn,username,clarification_text,user_agreement,consent_text,field
0,1,2022-07-16,5178249801,2349600692,True,True,False,[]
1,2,2022-06-25,9862687290,2655382030,True,True,True,"[{'id': 1, 'farm_name': 'Paget', 'lat': 47.935..."
2,3,2022-06-05,5730841345,4979548189,False,False,True,"[{'id': 1, 'farm_name': 'Parkside', 'lat': 45...."
3,4,2022-05-22,6701194524,2213833846,False,True,False,[]
4,5,2022-05-18,0139000380,4164911712,False,True,True,[]

In [23]:
credits = pd.DataFrame(response_info["credits"])
credits.head()

,id,created,created_amount,demand_gsm,city,town,username,tckn
0,1,2022-08-03,14136,8988047843,Jiang’an,0 Novick Court,2828789390,6210552307
1,2,2022-07-14,23773,2493561865,Candelaria,6 Cherokee Parkway,6099742344,4084245844
2,3,2022-06-18,130501,2074029926,Ono,9348 Lunder Trail,3888799340,0449677117
3,4,2022-05-30,47882,8855966732,Brezovica,42249 Bowman Place,4471451603,1728199247
4,5,2022-06-18,96258,4596224197,Asbest,03 Lyons Park,5493021312,4294842199

## Extract 'field' column to different dataframe

In [24]:
field_list = list()
for i in range(len(response_info["users"])):
    field_list.append(response_info["users"][i]["field"])

In [25]:
for i in range(len(field_list)):
    if len(field_list[i]) == 0:
        field_list[i] = [{'id': "",
        'farm_name': '',
        'lat': "",
        'lng': "",
        'area': "",
        'plant': '',
        'season_start_date': '',
        'season_end_date': ''}]
    else:
        continue

In [26]:
field_list[2]

[{'id': 1,
  'farm_name': 'Parkside',
  'lat': 45.287717074,
  'lng': 58.064253139,
  'area': 24.12880332,
  'plant': 'Starhorn',
  'season_start_date': '2022-05-08 17:24:33',
  'season_end_date': '2022-07-29 05:36:34'}]

In [16]:
from itertools import chain

In [17]:
users_fields = pd.DataFrame(list(chain.from_iterable(field_list)))
users_fields.head()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date
0,,,,,,,,
1,1,Paget,47.935201,13.710337,95.535737,Waterhyssop,2022-04-04 09:15:37,2022-05-15 20:20:36
2,1,Parkside,45.287717,58.064253,24.128803,Starhorn,2022-05-08 17:24:33,2022-07-29 05:36:34
3,,,,,,,,
4,,,,,,,,

## Add 'user_id' column to user_fields dataframe (like foreign key)

In [18]:
users_fields["user_id"] = users["id"]
users_fields.head()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date,user_id
0,,,,,,,,,1
1,1,Paget,47.935201,13.710337,95.535737,Waterhyssop,2022-04-04 09:15:37,2022-05-15 20:20:36,2
2,1,Parkside,45.287717,58.064253,24.128803,Starhorn,2022-05-08 17:24:33,2022-07-29 05:36:34,3
3,,,,,,,,,4
4,,,,,,,,,5

# Write json data to mysql database via dataframes.

In [124]:
from datetime import datetime
import sqlalchemy
from sqlalchemy import MetaData, exc, insert, update
engine = sqlalchemy.create_engine('YOUR_DB_CONN') # connect to server
engine.execute("USE logs") # select new db
conn = engine.connect()
meta = sqlalchemy.MetaData()
meta.reflect(engine, schema="logs")
meta.tables.keys()
logs_table = meta.tables["logs.logs"]

In [ ]:
try:
    engine.execute("CREATE DATABASE users_fields") #create db
    engine.execute("USE users_fields") # select new db
    conn = engine.connect()
except exc.SQLAlchemyError as e:
    query = insert(logs_table)
    query = query.values(err_code=e.__dict__["code"], err_statement=e.__dict__["statement"], err_msg=e.__dict__["orig"], err_occur_dt=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
    engine.execute(query)

(pymysql.err.ProgrammingError) (1007, "Can't create database 'users_fields'; database exists")
[SQL: CREATE DATABASE users_fields]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [30]:
users_fields.to_sql(name="users_fields", con=conn)

In [31]:
users_fields.head()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date,user_id
0,,,,,,,,,1
1,1,Paget,47.935201,13.710337,95.535737,Waterhyssop,2022-04-04 09:15:37,2022-05-15 20:20:36,2
2,1,Parkside,45.287717,58.064253,24.128803,Starhorn,2022-05-08 17:24:33,2022-07-29 05:36:34,3
3,,,,,,,,,4
4,,,,,,,,,5

In [26]:
try:
    engine.execute("CREATE DATABASE users") #create db
    engine.execute("USE users") # select new db
    conn = engine.connect()
except exc.SQLAlchemyError as e:
    query = insert(logs_table)
    query = query.values(err_code=e.__dict__["code"], err_statement=e.__dict__["statement"], err_msg=e.__dict__["orig"], err_occur_dt=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
    engine.execute(query)

In [27]:
users.drop(columns="field", inplace=True)
users.head()

,id,created,tckn,username,clarification_text,user_agreement,consent_text
0,1,2022-07-16,5178249801,2349600692,True,True,False
1,2,2022-06-25,9862687290,2655382030,True,True,True
2,3,2022-06-05,5730841345,4979548189,False,False,True
3,4,2022-05-22,6701194524,2213833846,False,True,False
4,5,2022-05-18,0139000380,4164911712,False,True,True

In [28]:
users.to_sql(name="users", con=conn)

In [117]:
try:    
    engine.execute("CREATE DATABASE credits") #create db
    engine.execute("USE credits") # select new db
    conn = engine.connect()

except exc.SQLAlchemyError as e:
    query = insert(logs_table)
    query = query.values(err_code=e.__dict__["code"], err_statement=e.__dict__["statement"], err_msg=e.__dict__["orig"], err_occur_dt=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
    engine.execute(query)

In [118]:
credits.head()

,id,created,created_amount,demand_gsm,city,town,username,tckn
0,1,2022-08-03,14136,8988047843,Jiang’an,0 Novick Court,2828789390,6210552307
1,2,2022-07-14,23773,2493561865,Candelaria,6 Cherokee Parkway,6099742344,4084245844
2,3,2022-06-18,130501,2074029926,Ono,9348 Lunder Trail,3888799340,0449677117
3,4,2022-05-30,47882,8855966732,Brezovica,42249 Bowman Place,4471451603,1728199247
4,5,2022-06-18,96258,4596224197,Asbest,03 Lyons Park,5493021312,4294842199

In [119]:
credits.to_sql(name="credits", con= conn)

In [43]:
engine.execute("USE users")
conn = engine.connect()

In [44]:
db_users = pd.read_sql("select * from users", con=conn)
db_users.drop(columns="index", inplace=True)
db_users.head()

,id,created,tckn,username,clarification_text,user_agreement,consent_text
0,1,2022-07-16,5178249801,2349600692,1,1,0
1,2,2022-06-25,9862687290,2655382030,1,1,1
2,3,2022-06-05,5730841345,4979548189,0,0,1
3,4,2022-05-22,6701194524,2213833846,0,1,0
4,5,2022-05-18,0139000380,4164911712,0,1,1

# Get database data to dataframe for compare json-server response and database data.

In [1]:
import pandas as pd
from datetime import datetime
import sqlalchemy
from sqlalchemy import MetaData, exc, insert, update
from itertools import chain
engine = sqlalchemy.create_engine('YOUR_DB_CONN')
pd.options.display.precision = 9

In [2]:
engine.execute("USE users_fields")
conn = engine.connect()
meta = sqlalchemy.MetaData()
meta.reflect(engine, schema="users_fields")

In [3]:
meta.tables.keys()

dict_keys(['users_fields.users_fields'])

In [4]:
try:
    db_fields = pd.read_sql("select * from users_fields", con=conn)
    db_fields.drop(columns="index", inplace=True)

except exc.SQLAlchemyError as e:
    query = insert(logs_table)
    query = query.values(err_code=e.__dict__["code"], err_statement=e.__dict__["statement"], err_msg=e.__dict__["orig"], err_occur_dt=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
    engine.execute(query)

db_fields.head()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date,user_id
0,,,,,,,,,1
1,1,Paget,47.93520072,13.710337028,95.535737494,Waterhyssop,2022-04-04 09:15:37,2022-05-15 20:20:36,2
2,1,Parkside,45.287717074,58.064253139,24.12880332,Starhorn,2022-05-08 17:24:33,2022-07-29 05:36:34,3
3,,,,,,,,,4
4,,,,,,,,,5

In [5]:
engine.execute("USE users")
conn = engine.connect()
meta = sqlalchemy.MetaData()
meta.reflect(engine, schema="users")

In [6]:
meta.tables.keys()

dict_keys(['users.users'])

In [7]:
try:
    db_users = pd.read_sql("select * from users", con=conn)
    db_users.drop(columns="index", inplace=True)

except exc.SQLAlchemyError as e:
    query = insert(logs_table)
    query = query.values(err_code=e.__dict__["code"], err_statement=e.__dict__["statement"], err_msg=e.__dict__["orig"], err_occur_dt=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
    engine.execute(query)

db_users.head()

,id,created,tckn,username,clarification_text,user_agreement,consent_text
0,1,2022-07-16,5178249801,2349600692,1,1,0
1,2,2022-06-25,9862687290,2655382030,1,1,1
2,3,2022-06-05,5730841345,4979548189,0,0,1
3,4,2022-05-22,6701194524,2213833846,0,1,0
4,5,2022-05-18,0139000380,4164911712,0,1,1

In [8]:
engine.execute("USE credits")
conn = engine.connect()
meta = sqlalchemy.MetaData()
meta.reflect(engine, schema="credits")

In [9]:
meta.tables.keys()

dict_keys(['credits.credits'])

In [10]:
try:
    db_credits = pd.read_sql("select * from credits", con=conn)
    db_credits.drop(columns="index", inplace=True)

except exc.SQLAlchemyError as e:
    query = insert(logs_table)
    query = query.values(err_code=e.__dict__["code"], err_statement=e.__dict__["statement"], err_msg=e.__dict__["orig"], err_occur_dt=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
    engine.execute(query)

db_credits.head()

,id,created,created_amount,demand_gsm,city,town,username,tckn
0,1,2022-08-03,14136,8988047843,Jiang’an,0 Novick Court,2828789390,6210552307
1,2,2022-07-14,23773,2493561865,Candelaria,6 Cherokee Parkway,6099742344,4084245844
2,3,2022-06-18,130501,2074029926,Ono,9348 Lunder Trail,3888799340,0449677117
3,4,2022-05-30,47882,8855966732,Brezovica,42249 Bowman Place,4471451603,1728199247
4,5,2022-06-18,96258,4596224197,Asbest,03 Lyons Park,5493021312,4294842199

## Get updated field data from json-server (with other tables)

In [11]:
import requests

In [12]:
response = requests.get("http://localhost:3000/response").text

In [27]:
response[0:2500]

'{\n  "users": [\n    {\n      "id": 1,\n      "created": "2022-07-16",\n      "tckn": "5178249801",\n      "username": "2349600692",\n      "clarification_text": true,\n      "user_agreement": true,\n      "consent_text": false,\n      "field": []\n    },\n    {\n      "id": 2,\n      "created": "2022-06-25",\n      "tckn": "9862687290",\n      "username": "2655382030",\n      "clarification_text": true,\n      "user_agreement": true,\n      "consent_text": true,\n      "field": [\n        {\n          "id": 1,\n          "farm_name": "Paget",\n          "lat": 47.93520072,\n          "lng": 13.710337028,\n          "area": 95.535737494,\n          "plant": "Waterhyssop",\n          "season_start_date": "2022-04-04 09:15:37",\n          "season_end_date": "2022-05-15 20:20:36"\n        }\n      ]\n    },\n    {\n      "id": 3,\n      "created": "2022-06-05",\n      "tckn": "5730841345",\n      "username": "4979548189",\n      "clarification_text": false,\n      "user_agreement": false,\n      "consent_text": true,\n      "field": [\n        {\n          "id": 1,\n          "farm_name": "Parkside",\n          "lat": 45.287717074,\n          "lng": 58.064253139,\n          "area": 24.12880332,\n          "plant": "Starhorn",\n          "season_start_date": "2022-05-08 17:24:33",\n          "season_end_date": "2022-07-29 05:36:34"\n        }\n      ]\n    },\n    {\n      "id": 4,\n      "created": "2022-05-22",\n      "tckn": "6701194524",\n      "username": "2213833846",\n      "clarification_text": false,\n      "user_agreement": true,\n      "consent_text": false,\n      "field": []\n    },\n    {\n      "id": 5,\n      "created": "2022-05-18",\n      "tckn": "0139000380",\n      "username": "4164911712",\n      "clarification_text": false,\n      "user_agreement": true,\n      "consent_text": true,\n      "field": []\n    },\n    {\n      "id": 6,\n      "created": "2022-07-18",\n      "tckn": "3837556891",\n      "username": "3179584399",\n      "clarification_text": true,\n      "user_agreement": true,\n      "consent_text": false,\n      "field": [\n        {\n          "id": 1,\n          "farm_name": "3rd",\n          "lat": 48.529810885,\n          "lng": 38.493641502,\n          "area": 82.89315977,\n          "plant": "Salinas River Tarweed",\n          "season_start_date": "2022-06-19 01:04:36",\n          "season_end_date": "2022-07-16 06:14:16"\n        }\n      ]\n    },\n    {\n      "id": 7,\n      "created": "2022-04-24",\n      "tckn": "1183755635",\n      "username": "2423866368",\n      "clarification_text": false,\n      "user_agreeme'

In [14]:
import json

In [28]:
response_data = json.loads(response)

In [29]:
type(response_data)

dict

## Transform data to dataframe

In [18]:
response_credits = pd.DataFrame(response_data["credits"])
response_credits.tail()

,id,created,created_amount,demand_gsm,city,town,username,tckn
996,997,2022-08-06,63442,4442317763,Sredno Konjare,9359 Pepper Wood Circle,8544500170,4484704420
997,998,2022-04-05,237525,8614334799,Bestovje,94223 Main Avenue,9977570318,2483996183
998,999,2022-04-11,162867,2798804299,Ozherel’ye,5 Rusk Pass,3512825209,8241399448
999,1000,2022-05-17,191970,8528855960,Babao,6031 Gale Alley,4174718589,7070702329
1000,1001,2022-05-17,191970,8528855960,test,6031 Gale Alley,4174718589,7070702329

In [19]:
response_users = pd.DataFrame(response_data["users"])
response_users.head()

,id,created,tckn,username,clarification_text,user_agreement,consent_text,field
0,1,2022-07-16,5178249801,2349600692,True,True,False,[]
1,2,2022-06-25,9862687290,2655382030,True,True,True,"[{'id': 1, 'farm_name': 'Paget', 'lat': 47.935..."
2,3,2022-06-05,5730841345,4979548189,False,False,True,"[{'id': 1, 'farm_name': 'Parkside', 'lat': 45...."
3,4,2022-05-22,6701194524,2213833846,False,True,False,[]
4,5,2022-05-18,0139000380,4164911712,False,True,True,[]

In [30]:
field_list = list()
for i in range(len(response_data["users"])):
    field_list.append(response_data["users"][i]["field"])

In [31]:
for i in range(len(field_list)):
    if len(field_list[i]) == 0:
        field_list[i] = [{'id': "",
        'farm_name': '',
        'lat': "",
        'lng': "",
        'area': "",
        'plant': '',
        'season_start_date': '',
        'season_end_date': ''}]
    else:
        continue

In [22]:
field_list[1000]

[{'id': 1,
  'farm_name': 'test',
  'lat': 21.24518213,
  'lng': 11.894639177,
  'area': 44.215076979,
  'plant': 'Arrowleaf Balsamroot',
  'season_start_date': '2022-05-05 20:00:53',
  'season_end_date': '2022-05-27 10:30:38'}]

In [24]:
response_fields = pd.DataFrame(list(chain.from_iterable(field_list)))
response_fields.tail()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date
996,,,,,,,,
997,1,Hudson,23.005947212,49.463256116,58.316422576,Nipple Beach Phacelia,2022-06-07 17:28:40,2022-04-13 13:08:47
998,1,Waxwing,36.454989371,90.576276314,43.760100669,Sensitive Jointvetch,2022-07-28 01:39:52,2022-04-29 01:37:50
999,1,Kipling,21.24518213,11.894639177,44.215076979,Arrowleaf Balsamroot,2022-05-05 20:00:53,2022-05-27 10:30:38
1000,1,test,21.24518213,11.894639177,44.215076979,Arrowleaf Balsamroot,2022-05-05 20:00:53,2022-05-27 10:30:38

In [25]:
response_fields["user_id"] = response_users["id"]
response_fields.tail()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date,user_id
996,,,,,,,,,997
997,1,Hudson,23.005947212,49.463256116,58.316422576,Nipple Beach Phacelia,2022-06-07 17:28:40,2022-04-13 13:08:47,998
998,1,Waxwing,36.454989371,90.576276314,43.760100669,Sensitive Jointvetch,2022-07-28 01:39:52,2022-04-29 01:37:50,999
999,1,Kipling,21.24518213,11.894639177,44.215076979,Arrowleaf Balsamroot,2022-05-05 20:00:53,2022-05-27 10:30:38,1000
1000,1,test,21.24518213,11.894639177,44.215076979,Arrowleaf Balsamroot,2022-05-05 20:00:53,2022-05-27 10:30:38,1001

In [26]:
db_fields.tail()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date,user_id
995,,,,,,,,,996
996,,,,,,,,,997
997,1,Hudson,23.005947212,49.463256116,58.316422576,Nipple Beach Phacelia,2022-06-07 17:28:40,2022-04-13 13:08:47,998
998,1,Waxwing,36.454989371,90.576276314,43.760100669,Sensitive Jointvetch,2022-07-28 01:39:52,2022-04-29 01:37:50,999
999,1,Kipling,21.24518213,11.894639177,44.215076979,Arrowleaf Balsamroot,2022-05-05 20:00:53,2022-05-27 10:30:38,1000

In [27]:
response_users.drop(columns="field", axis=1, inplace=True)

# Add or update new users to users table db

In [ ]:
response_users.tail()

,id,created,tckn,username,clarification_text,user_agreement,consent_text
996,997,2022-06-01,1350349720,2926523977,False,False,True
997,998,2022-06-21,8251686687,3958233692,False,False,False
998,999,2022-06-14,0148120490,5294376554,True,False,True
999,1000,2022-05-28,6381771585,7877236549,True,False,False
1000,1001,2022-05-28,6381771585,7877236549,True,False,True

In [ ]:
db_users.tail()

,id,created,tckn,username,clarification_text,user_agreement,consent_text
995,996,2022-07-30,8517648897,9505171172,0,0,1
996,997,2022-06-01,1350349720,2926523977,0,0,1
997,998,2022-06-21,8251686687,3958233692,0,0,0
998,999,2022-06-14,0148120490,5294376554,1,0,1
999,1000,2022-05-28,6381771585,7877236549,1,0,0

In [ ]:
import numpy as np

In [ ]:
response_users.iloc[3,4] = True

In [ ]:
users_diff = response_users[~response_users.apply(tuple,1).isin(db_users.apply(tuple,1))]

In [ ]:
users_diff.head()

,id,created,tckn,username,clarification_text,user_agreement,consent_text
1000,1001,2022-05-28,6381771585,7877236549,True,False,True

## Because of type mismatches, we preprocess the compared data before updating db. (users)

In [ ]:
users_diff.clarification_text = users_diff.clarification_text.astype(int)

C:\Users\Furka\anaconda3\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [ ]:
users_diff.user_agreement = users_diff.user_agreement.astype(int)

In [ ]:
users_diff.consent_text = users_diff.consent_text.astype(int)

In [ ]:
users_diff.head()

,id,created,tckn,username,clarification_text,user_agreement,consent_text
1000,1001,2022-05-28,6381771585,7877236549,1,0,1

In [ ]:
engine.execute("USE users")
conn = engine.connect()
meta = sqlalchemy.MetaData()
meta.reflect(engine, schema="users")

In [ ]:
meta.tables.keys()

dict_keys(['users.users'])

In [ ]:
users_table = meta.tables["users.users"]

In [ ]:
len(users_diff)

1

In [ ]:
users_diff.head()

,id,created,tckn,username,clarification_text,user_agreement,consent_text
1000,1001,2022-05-28,6381771585,7877236549,1,0,1

In [ ]:
db_users.tail()

,id,created,tckn,username,clarification_text,user_agreement,consent_text
995,996,2022-07-30,8517648897,9505171172,0,0,1
996,997,2022-06-01,1350349720,2926523977,0,0,1
997,998,2022-06-21,8251686687,3958233692,0,0,0
998,999,2022-06-14,0148120490,5294376554,1,0,1
999,1000,2022-05-28,6381771585,7877236549,1,0,0

In [ ]:
for i in range(len(users_diff)):
    try:
        if users_diff.iloc[i,0] in db_users["id"].values: ##or check tckn column
            u = update(users_table)
            u = u.values(id=users_diff.iloc[i,0], created=users_diff.iloc[i,1], tckn=users_diff.iloc[i,2], username=users_diff.iloc[i,3], clarification_text=users_diff.iloc[i,4], user_agreement=users_diff.iloc[i,5], consent_text=users_diff.iloc[i,6])
            u = u.where(users_table.c.id == users_diff.iloc[i,0])
            engine.execute(u)
        else:
            ins = insert(users_table)
            ins = ins.values(id=users_diff.iloc[i,0], created=users_diff.iloc[i,1], tckn=users_diff.iloc[i,2], username=users_diff.iloc[i,3], clarification_text=users_diff.iloc[i,4], user_agreement=users_diff.iloc[i,5], consent_text=users_diff.iloc[i,6])
            engine.execute(ins)
    except exc.SQLAlchemyError as e:
        query = insert(logs_table)
        query = query.values(err_code=e.__dict__["code"], err_statement=e.__dict__["statement"], err_msg=e.__dict__["orig"], err_occur_dt=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
        engine.execute(query)

# Add or update new users fields to users_fields table db

In [46]:
response_fields.tail()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date,user_id
996,,,,,,,,,997
997,1,Hudson,23.005947212,49.463256116,58.316422576,Nipple Beach Phacelia,2022-06-07 17:28:40,2022-04-13 13:08:47,998
998,1,Waxwing,36.454989371,90.576276314,43.760100669,Sensitive Jointvetch,2022-07-28 01:39:52,2022-04-29 01:37:50,999
999,1,Kipling,21.24518213,11.894639177,44.215076979,Arrowleaf Balsamroot,2022-05-05 20:00:53,2022-05-27 10:30:38,1000
1000,1,test,21.24518213,11.894639177,44.215076979,Arrowleaf Balsamroot,2022-05-05 20:00:53,2022-05-27 10:30:38,1001

In [47]:
db_fields.tail()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date,user_id
995,,,,,,,,,996
996,,,,,,,,,997
997,1,Hudson,23.005947212,49.463256116,58.316422576,Nipple Beach Phacelia,2022-06-07 17:28:40,2022-04-13 13:08:47,998
998,1,Waxwing,36.454989371,90.576276314,43.760100669,Sensitive Jointvetch,2022-07-28 01:39:52,2022-04-29 01:37:50,999
999,1,Kipling,21.24518213,11.894639177,44.215076979,Arrowleaf Balsamroot,2022-05-05 20:00:53,2022-05-27 10:30:38,1000

## Because of type mismatches, we preprocess the data before compare. (users_fields)

In [48]:
for i in range(len(db_fields["lat"])):
    if db_fields.loc[i, "lat"] != "":
        db_fields.loc[i, "lat"] = float(db_fields.loc[i, "lat"])
    else:
        continue

In [49]:
for i in range(len(db_fields["lng"])):
    if db_fields.loc[i, "lng"] != "":
        db_fields.loc[i, "lng"] = float(db_fields.loc[i, "lng"])
    else:
        continue

In [50]:
for i in range(len(db_fields["area"])):
    if db_fields.loc[i, "area"] != "":
        db_fields.loc[i, "area"] = float(db_fields.loc[i, "area"])
    else:
        continue

In [51]:
for i in range(len(db_fields["id"])):
    if db_fields.loc[i, "id"] != "":
        db_fields.loc[i, "id"] = int(db_fields.loc[i, "id"])
    else:
        continue

In [53]:
response_fields.head()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date,user_id
0,,,,,,,,,1
1,1,Paget,47.93520072,13.710337028,95.535737494,Waterhyssop,2022-04-04 09:15:37,2022-05-15 20:20:36,2
2,1,Parkside,45.287717074,58.064253139,24.12880332,Starhorn,2022-05-08 17:24:33,2022-07-29 05:36:34,3
3,,,,,,,,,4
4,,,,,,,,,5

In [54]:
db_fields.head()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date,user_id
0,,,,,,,,,1
1,1,Paget,47.93520072,13.710337028,95.535737494,Waterhyssop,2022-04-04 09:15:37,2022-05-15 20:20:36,2
2,1,Parkside,45.287717074,58.064253139,24.12880332,Starhorn,2022-05-08 17:24:33,2022-07-29 05:36:34,3
3,,,,,,,,,4
4,,,,,,,,,5

### Change response data for testing

In [55]:
response_fields.loc[1, "farm_name"] = "test"

### Comparing two dataframes

In [52]:
fields_diff = response_fields[~response_fields.apply(tuple,1).isin(db_fields.apply(tuple,1))]

In [53]:
fields_diff.head()

,id,farm_name,lat,lng,area,plant,season_start_date,season_end_date,user_id
1000,1,test,21.24518213,11.894639177,44.215076979,Arrowleaf Balsamroot,2022-05-05 20:00:53,2022-05-27 10:30:38,1001

## Update the 'field' table in database.

In [55]:
engine.execute("USE users_fields")
conn = engine.connect()
meta = sqlalchemy.MetaData()
meta.reflect(engine, schema="users_fields")

In [56]:
meta.tables.keys()

dict_keys(['users_fields.users_fields'])

In [57]:
fields_table = meta.tables["users_fields.users_fields"]
for i in range(len(fields_diff)):
        try:
            if fields_diff.iloc[i,8] in db_fields["user_id"].values:     ##if fields_diff.iloc[0,8] in db_fields["user_id"].values:  
                u = update(fields_table)
                u = u.values(id=fields_diff.iloc[i,0], farm_name=fields_diff.iloc[i,1], lat=fields_diff.iloc[i,2], lng=fields_diff.iloc[i,3], area=fields_diff.iloc[i,4], plant=fields_diff.iloc[i,5], season_start_date=fields_diff.iloc[i,6], season_end_date=fields_diff.iloc[i,7], user_id=fields_diff.iloc[i,8])
                u = u.where(fields_table.c.user_id == fields_diff.iloc[i,8])
                engine.execute(u)
            else:
                ins = insert(fields_table)
                ins = ins.values(id=fields_diff.iloc[i,0], farm_name=fields_diff.iloc[i,1], lat=fields_diff.iloc[i,2], lng=fields_diff.iloc[i,3], area=fields_diff.iloc[i,4], plant=fields_diff.iloc[i,5], season_start_date=fields_diff.iloc[i,6], season_end_date=fields_diff.iloc[i,7], user_id=fields_diff.iloc[i,8])
                engine.execute(ins)
        except exc.SQLAlchemyError as e:
            query = insert(logs_table)
            query = query.values(err_code=e.__dict__["code"], err_statement=e.__dict__["statement"], err_msg=e.__dict__["orig"], err_occur_dt=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
            engine.execute(query)

# Add or update new users credits to credits table db

In [58]:
response_credits.tail()

,id,created,created_amount,demand_gsm,city,town,username,tckn
996,997,2022-08-06,63442,4442317763,Sredno Konjare,9359 Pepper Wood Circle,8544500170,4484704420
997,998,2022-04-05,237525,8614334799,Bestovje,94223 Main Avenue,9977570318,2483996183
998,999,2022-04-11,162867,2798804299,Ozherel’ye,5 Rusk Pass,3512825209,8241399448
999,1000,2022-05-17,191970,8528855960,Babao,6031 Gale Alley,4174718589,7070702329
1000,1001,2022-05-17,191970,8528855960,test,6031 Gale Alley,4174718589,7070702329

In [59]:
db_credits.tail()

,id,created,created_amount,demand_gsm,city,town,username,tckn
995,996,2022-05-03,165338,4725146768,Kista,26706 Namekagon Center,3838611046,5104480941
996,997,2022-08-06,63442,4442317763,Sredno Konjare,9359 Pepper Wood Circle,8544500170,4484704420
997,998,2022-04-05,237525,8614334799,Bestovje,94223 Main Avenue,9977570318,2483996183
998,999,2022-04-11,162867,2798804299,Ozherel’ye,5 Rusk Pass,3512825209,8241399448
999,1000,2022-05-17,191970,8528855960,Babao,6031 Gale Alley,4174718589,7070702329

In [84]:
response_credits.loc[4,"city"] = "test"

In [85]:
response_credits.head()

,id,created,created_amount,demand_gsm,city,town,username,tckn
0,1,2022-08-03,14136,8988047843,Jiang’an,0 Novick Court,2828789390,6210552307
1,2,2022-07-14,23773,2493561865,Candelaria,6 Cherokee Parkway,6099742344,4084245844
2,3,2022-06-18,130501,2074029926,Ono,9348 Lunder Trail,3888799340,0449677117
3,4,2022-05-30,47882,8855966732,Brezovica,42249 Bowman Place,4471451603,1728199247
4,5,2022-06-18,96258,4596224197,test,03 Lyons Park,5493021312,4294842199

In [60]:
credits_diff = response_credits[~response_credits.apply(tuple,1).isin(db_credits.apply(tuple,1))]

In [61]:
credits_diff.head()

,id,created,created_amount,demand_gsm,city,town,username,tckn
1000,1001,2022-05-17,191970,8528855960,test,6031 Gale Alley,4174718589,7070702329

In [62]:
engine.execute("USE credits")
conn = engine.connect()
meta = sqlalchemy.MetaData()
meta.reflect(engine, schema="credits")

In [63]:
meta.tables.keys()

dict_keys(['credits.credits'])

In [64]:
credits_table = meta.tables["credits.credits"]

In [65]:
len(credits_diff)

1

In [66]:
credits_diff.iloc[0,7] in db_credits["tckn"].values

True

In [67]:
for i in range(len(credits_diff)):
    try:
        if credits_diff.iloc[i,7] in db_credits["tckn"].values:
            u = update(credits_table)
            u = u.values(id=credits_diff.iloc[i,0], created=credits_diff.iloc[i,1], created_amount=credits_diff.iloc[i,2], demand_gsm=credits_diff.iloc[i,3], city=credits_diff.iloc[i,4], town=credits_diff.iloc[i,5], username=credits_diff.iloc[i,6], tckn=credits_diff.iloc[i,7])
            u = u.where(credits_table.c.tckn == credits_diff.iloc[i,7])
            engine.execute(u)
        else:
            ins = insert(credits_table)
            ins = ins.values(id=credits_diff.iloc[i,0], created=credits_diff.iloc[i,1], created_amount=credits_diff.iloc[i,2], demand_gsm=credits_diff.iloc[i,3], city=credits_diff.iloc[i,4], town=credits_diff.iloc[i,5], username=credits_diff.iloc[i,6], tckn=credits_diff.iloc[i,7])
            engine.execute(ins)
    except exc.SQLAlchemyError as e:
        query = insert(logs_table)
        query = query.values(err_code=e.__dict__["code"], err_statement=e.__dict__["statement"], err_msg=e.__dict__["orig"], err_occur_dt=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
        engine.execute(query)